Revit 2024 API
CodeCheckingParameterServiceData Class
 The data needed by code checking server to perform code checking.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class CodeCheckingParameterServiceData : IDisposable
Visual Basic
Public Class CodeCheckingParameterServiceData _
	Implements IDisposable
Visual C++
public ref class CodeCheckingParameterServiceData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData
See Also
CodeCheckingParameterServiceData Members
Autodesk.Revit.DB.Structure Namespace